# 2. Реализовать класс Road (дорога), в котором определить атрибуты:
# length (длина), width (ширина). Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого для покрытия
# всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом, 
# толщиной в 1 см * число см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:
    ud_mass = 25
    depth = 5

    def __init__(self, length, width):
        self._length = length
        self._width = width

    def get_asphalt_mass(self):
        print(f'You will need {(self._length * self._width * self.ud_mass * self.depth) / 1000} tons of asphalt')


mass = Road(5000, 20)
mass.get_asphalt_mass()
