# Реализовать генератор с помощью функции с ключевым словом yield,
# создающим очередное значение. При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо
# выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n.
# Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

from math import factorial


def fact(n):
    for i in range(1, n + 1):
        x = factorial(i)
        yield x


try:
    n = int(input('Введите число: '))
    if n < 0:
        raise ValueError
    elif n == 0:
        print('Факториал 0 равен 1')
    else:
        print(f'Факториалы чисел до {n} равны:')
        for el in fact(n):
            print(el, end=' ')
except ValueError:
    print('ОШИБКА. Введите целое неотрицательное число')
